#+TITLE: Doing Things
#+AUTHOR: Rémi Louf
#+EMAIL: sample@thetypicalset.com
#+STARTUP: content hideblocks
#+LANGUAGE: en
#+OPTIONS: toc:2 num:nil html-postamble:nil

** The life of a TODO

Captured items are all in a *TODO* state, completed tasks are in the terminal *DONE* state. It is useful to define other, non terminal, states. *NEXT* expresses, in each project, which task is to be completed next. *HOLD* which task is currently on hold. *WAIT* which tasks are waiting for someone else's input (or has been delegated).

#+begin_src elisp
; Setting the state to HOLD or CANCELLED will prompt for a note.
(setq org-todo-keywords
     '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
       (sequence "HOLD(h@)" "WAITING(w)" "|" "CANCELLED(c@)")))

(setq-default org-enforce-todo-dependencies t)
#+end_src

Org mode's includes a [[https://orgmode.org/manual/Tracking-TODO-state-changes.html#FOOT44][powerful mechanism to track TODO state changes]] but we will use something simpler here. Many setups track the creation date, but I haven't found that information to be particularly actionable. It is however useful to know a task's activation date. Following [[https://www.labri.fr/perso/nrougier/GTD/index.html#org0b0e616][Nicolas Rougier]] and [[https://emacs.stackexchange.com/questions/35751/how-to-add-a-created-field-to-any-todo-task][ebpa]] we define the following function to add an /ACTIVATED/ property to the task when it first comes into the *NEXT* state:

#+begin_src elisp
(defun my/log-todo-next-creation-date (&rest ignore)
  "Log NEXT creation time in the property drawer uder the key 'ACTIVATED"
  (when (and (string= (org-get-todo-state) "NEXT")
             (not (org-entry-get nil "ACTIVATED")))
    (org-entry-put nil "ACTIVATED" (format-time-string "[%Y-%m-%d %a %H:%M]"))))

(add-hook 'org-after-todo-state-change-hook #'my/log-todo-next-creation-date)
#+end_src

#+RESULTS:
| my/log-todo-delegation-date | my/log-todo-next-creation-date |

#+begin_src org
,* NEXT Document the =hmc= class
   :PROPERTIES:
   :CREATED: [2022-03-26 Sun 18:45]
   :ACTIVATED: [2022-03-28 Tue 12:03]
   :END:
#+end_src

When waiting for someone it is always useful to know how long the task has been delegated for. We thus add a /DELEGATED/ property to the task when it comes under the /WAIT/ state. If the property already exists, it is updated:

#+begin_src elisp
(defun my/log-todo-delegation-date (&rest ignore)
  "Log last WAIT creation time in the property drawer uder the key DELEGATED"
  (when (string= (org-get-todo-state) "WAIT")
    (org-entry-put nil "DELEGATED" (format-time-string "[%Y-%m-%d %a %H:%M]"))))

(add-hook 'org-after-todo-state-change-hook #'my/log-todo-delegation-date)
#+end_src

#+RESULTS:
| my/log-todo-delegation-date |

#+begin_src org
,* WAIT Document the =hmc= class
   :PROPERTIES:
   :CREATED: [2022-03-26 Sun 18:45]
   :ACTIVATED: [2022-03-28 Tue 12:03]
   :DELEGATED: [2022-03-28 Tue 14:32]
   :END:
#+end_src

Finally we keep track of when a task was completed. This is useful which tasks were completed any given period of time, which is useful for reporting. We use Org's [[https://orgmode.org/manual/Special-Properties.html][special property]]:

#+begin_src elisp
(setq org-log-done 'time)
#+end_src
